In [6]:

import pandas as pd
import numpy as np
from sqlalchemy import create_engine
# from config import password

## Merge netflix and omdb csv files

In [7]:
file = "netflix_titles.csv"
netflix_df = pd.read_csv(file)
file = "omdb_list.csv"
omdb_df = pd.read_csv(file)

In [8]:
omdb_df.head()

,Unnamed: 0,title,genre,runtime,imdbRating,imdbVotes,poster,awards,boxoffice,language
0,0,Norm of the North: King Sized Adventure,"Animation, Adventure, Comedy, Family",90 min,3.3,311,https://m.media-amazon.com/images/M/MV5BNjMwZD...,NaN,NaN,English
1,1,Jandino: Whatever it Takes,Comedy,95 min,4.8,23,https://m.media-amazon.com/images/M/MV5BMWE3MG...,NaN,NaN,"English, Dutch"
2,2,Transformers Prime,"Animation, Action, Adventure, Comedy, Drama, F...",30 min,7.9,"5,454",https://m.media-amazon.com/images/M/MV5BMTczND...,14 wins & 26 nominations.,NaN,English
3,3,Transformers: Robots in Disguise,"Animation, Action, Adventure, Comedy, Sci-Fi",22 min,6.0,842,https://m.media-amazon.com/images/M/MV5BMjMwNT...,2 wins & 11 nominations.,NaN,English
4,4,Apaches,Drama,82 min,5.9,292,https://m.media-amazon.com/images/M/MV5BODYyOT...,3 nominations.,NaN,"French, Arabic"

In [9]:
omdb_unique_df = omdb_df.drop_duplicates(subset=['title'])
print(len(omdb_df))
print(len(omdb_unique_df))

5473
5412

In [10]:
merged_df = netflix_df.merge(omdb_unique_df, how="left", on="title")
merged_df['imdbVotes']= merged_df['imdbVotes'].str.replace(',', '')
merged_df['imdbVotes']= merged_df['imdbVotes'].fillna(0)
merged_df['imdbVotes']= merged_df['imdbVotes'].astype(int)
print(len(merged_df))
merged_df.head()

6234

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,...,description,Unnamed: 0,genre,runtime,imdbRating,imdbVotes,poster,awards,boxoffice,language
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,...,Before planning an awesome wedding for his gra...,0.0,"Animation, Adventure, Comedy, Family",90 min,3.3,311,https://m.media-amazon.com/images/M/MV5BNjMwZD...,NaN,NaN,English
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,...,Jandino Asporaat riffs on the challenges of ra...,1.0,Comedy,95 min,4.8,23,https://m.media-amazon.com/images/M/MV5BMWE3MG...,NaN,NaN,"English, Dutch"
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,...,"With the help of three human allies, the Autob...",2.0,"Animation, Action, Adventure, Comedy, Drama, F...",30 min,7.9,5454,https://m.media-amazon.com/images/M/MV5BMTczND...,14 wins & 26 nominations.,NaN,English
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,...,When a prison ship crash unleashes hundreds of...,3.0,"Animation, Action, Adventure, Comedy, Sci-Fi",22 min,6.0,842,https://m.media-amazon.com/images/M/MV5BMjMwNT...,2 wins & 11 nominations.,NaN,English
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,...,When nerdy high schooler Dani finally attracts...,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN

## Transform netflix genre

In [11]:
# Turn listed_in into list
merged_df.listed_in = merged_df.listed_in.str.split(',').tolist()
listed_df = merged_df.dropna(subset=['listed_in'])
listed_in = listed_df["listed_in"].tolist()

In [12]:
# Loop through listed_in (netflix genre) and get unique values into netflix_genre set
netflix_genre = set()

for movie in listed_in:
    for x in movie:
        netflix_genre.add(x)
print(netflix_genre)

netflix_genre_id = pd.DataFrame(netflix_genre, columns=["netflix_genre"])
netflix_genre_id["netflix_genre"]=netflix_genre_id["netflix_genre"].str.strip()
netflix_genre_id = netflix_genre_id.drop_duplicates()
netflix_genre_id = netflix_genre_id.reset_index()
netflix_genre_id = netflix_genre_id.rename(columns={'index': 'netflix_genre_no'})
print(len(netflix_genre_id))
netflix_genre_id.head()

{'Cult Movies', ' TV Comedies', ' Cult Movies', 'Romantic Movies', 'Music & Musicals', 'Anime Series', ' Music & Musicals', ' Korean TV Shows', 'Stand-Up Comedy', 'TV Horror', 'Classic & Cult TV', ' Science & Nature TV', 'TV Comedies', 'Reality TV', ' Spanish-Language TV Shows', ' Teen TV Shows', ' Romantic Movies', ' TV Action & Adventure', ' LGBTQ Movies', 'International TV Shows', 'Movies', ' Sports Movies', ' Anime Features', 'Sci-Fi & Fantasy', ' Stand-Up Comedy & Talk Shows', ' Children & Family Movies', " Kids' TV", ' Documentaries', 'TV Action & Adventure', 'Comedies', ' Sci-Fi & Fantasy', 'Anime Features', ' Horror Movies', ' Stand-Up Comedy', 'Horror Movies', ' Faith & Spirituality', 'TV Shows', ' Thrillers', "Kids' TV", 'Romantic TV Shows', ' Docuseries', 'International Movies', 'Docuseries', ' Romantic TV Shows', ' Reality TV', ' Independent Movies', 'Sports Movies', 'Children & Family Movies', ' Classic Movies', ' Crime TV Shows', ' Classic & Cult TV', ' TV Dramas', 'Crime TV Shows', 'British TV Shows', ' International TV Shows', 'Stand-Up Comedy & Talk Shows', ' Dramas', 'TV Sci-Fi & Fantasy', 'Dramas', ' TV Sci-Fi & Fantasy', ' International Movies', 'Independent Movies', 'Action & Adventure', ' TV Thrillers', ' TV Mysteries', 'Spanish-Language TV Shows', 'Documentaries', 'Classic Movies', 'Thrillers', ' TV Horror', ' Comedies', 'TV Dramas'}
42

   netflix_genre_no     netflix_genre
0                 0       Cult Movies
1                 1       TV Comedies
2                 3   Romantic Movies
3                 4  Music & Musicals
4                 5      Anime Series

In [13]:
# Break out genres (listed_in) with show_id
listed_in_df = merged_df.loc[:,['show_id', 'listed_in']]
listed_in_df = listed_in_df.explode('listed_in')
listed_in_df['listed_in'] = listed_in_df['listed_in'].str.strip()
listed_in_df = listed_in_df.rename(columns={'listed_in': 'netflix_genre'})
print(len(listed_in_df))
listed_in_df.head()

13670

    show_id             netflix_genre
0  81145628  Children & Family Movies
0  81145628                  Comedies
1  80117401           Stand-Up Comedy
2  70234439                  Kids' TV
3  80058654                  Kids' TV

In [14]:
# merge tables to create show_id and genre_id table
netflix_genre_table = listed_in_df.merge(netflix_genre_id,how = "left", on="netflix_genre")
netflix_genre_table = netflix_genre_table.loc[:,['show_id','netflix_genre_no']]
print(len(netflix_genre_table))
netflix_genre_table.head()

13670

    show_id  netflix_genre_no
0  81145628                25
1  81145628                29
2  80117401                 8
3  70234439                26
4  80058654                26

## Transform omdb genre

In [15]:
# Turn genre into list 
merged_df.genre = merged_df.genre.str.split(',').tolist()
genre_df = merged_df.dropna(subset=['genre'])
genre = genre_df["genre"].tolist()

In [16]:
# Loop through genre (omdb genre) and get unique values into omdb_genre set
omdb_genre = set()

for movie in genre:
    for y in movie:
        omdb_genre.add(y)
print(omdb_genre)

omdb_genre_id = pd.DataFrame(omdb_genre, columns=["omdb_genre"])
omdb_genre_id["omdb_genre"]=omdb_genre_id["omdb_genre"].str.strip()
omdb_genre_id = omdb_genre_id.drop_duplicates()
omdb_genre_id = omdb_genre_id.reset_index()
omdb_genre_id = omdb_genre_id.rename(columns={'index': 'omdb_genre_no'})
print(len(omdb_genre_id))
omdb_genre_id.head()

{'Romance', ' Sport', 'Sci-Fi', 'Music', 'Family', 'News', ' Family', ' Talk-Show', ' Action', ' Fantasy', ' Documentary', ' Thriller', ' Animation', 'Drama', 'Crime', ' Music', 'Musical', ' Mystery', 'Fantasy', 'Western', 'War', 'Mystery', 'Talk-Show', 'Game-Show', ' Drama', ' Game-Show', 'Sport', 'Horror', ' Short', 'Thriller', 'Adult', 'Action', ' Horror', ' History', 'Documentary', 'Reality-TV', 'Comedy', ' News', 'History', ' Biography', ' War', ' Sci-Fi', 'Short', ' Crime', ' Adventure', ' Reality-TV', ' Comedy', ' Musical', ' Western', 'Biography', 'Animation', ' Romance', ' Film-Noir', 'Adventure'}
28

   omdb_genre_no omdb_genre
0              0    Romance
1              1      Sport
2              2     Sci-Fi
3              3      Music
4              4     Family

In [17]:
# Break out genres with show_id
genre_df = merged_df.loc[:,['show_id', 'genre']]
genre_df = genre_df.explode('genre')
genre_df['genre'] = genre_df['genre'].str.strip()
genre_df = genre_df.rename(columns={'genre': 'omdb_genre'})
genre_df.dropna(inplace = True)
print(len(genre_df))
genre_df.head()

13276

    show_id omdb_genre
0  81145628  Animation
0  81145628  Adventure
0  81145628     Comedy
0  81145628     Family
1  80117401     Comedy

In [18]:
# merge tables to create show_id and genre_id table
omdb_genre_table = genre_df.merge(omdb_genre_id,how = "left", on="omdb_genre")
omdb_genre_table = omdb_genre_table.loc[:,['show_id','omdb_genre_no']]
print(len(omdb_genre_table))
omdb_genre_table.head()

13276

    show_id  omdb_genre_no
0  81145628             12
1  81145628             44
2  81145628             36
3  81145628              4
4  80117401             36

## Transform language table

In [19]:
# Turn language into list 
merged_df.language = merged_df.language.str.split(',').tolist()
lan_df = merged_df.dropna(subset=['language'])
language = lan_df["language"].tolist()
print(len(language))

5320

In [20]:
# Loop through language (omdb language) and get unique values into language_set set
language_set = set()

for row in language:
    for i in row:
        language_set.add(i)
print(language_set)

language_df = pd.DataFrame(language_set, columns=["language"])
language_df["language"]=language_df["language"].str.strip()
language_df = language_df.drop_duplicates()
language_df = language_df.reset_index()
language_df = language_df.rename(columns={'index': 'language_no'})
print(len(language_df))
language_df.head()

{' Berber languages', ' Pushto', 'Romanian', 'Hungarian', ' Egyptian (Ancient)', 'American Sign Language', 'Finnish', ' Ewe', ' Greek', 'Hindi', ' Assamese', 'Gujarati', ' Burmese', ' Telugu', ' Teochew', ' Greenlandic', ' Dari', ' Malayalam', 'Greek', ' Portuguese', 'Marathi', ' Filipino', ' Latvian', ' Mapudungun', 'Korean', 'Serbian', ' Kurdish', 'Turkish', ' Bosnian', ' Chinese', 'Punjabi', ' Hungarian', 'Assamese', ' Mixtec', 'Basque', ' Sanskrit', ' Tagalog', 'Kikuyu', 'Georgian', 'Vietnamese', 'Neapolitan', ' Vietnamese', ' Indonesian', 'Flemish', ' Albanian', ' Polish', ' Mohawk', 'Sanskrit', 'Dutch', ' Bhojpuri', ' American Sign Language', 'Icelandic', ' Ukrainian', 'Telugu', 'None', ' Sinhalese', ' Swiss German', ' Tamil', 'Afrikaans', ' Latin', 'Oriya', 'Swedish', ' Khmer', ' Japanese', ' Lithuanian', ' Assyrian Neo-Aramaic', 'Italian', ' Turkmen', 'Latin', 'Arabic', 'Filipino', ' Syriac', 'Ukrainian Sign Language', ' Malay', 'Wolof', ' Scottish Gaelic', ' Irish', ' Somali', ' Amharic', 'Bhojpuri', 'Malayalam', 'Persian', ' Bengali', ' Saami', ' Washoe', ' Bulgarian', ' Hausa', ' Akan', 'Tamil', 'Bengali', 'Urdu', ' Korean', ' Croatian', 'Thai', ' Czech', 'Welsh', 'Yoruba', ' Dutch', 'Japanese', ' Ibo', 'German', 'Polish', ' Zulu', ' Yoruba', ' Swahili', 'Zulu', ' Estonian', ' Quenya', ' British Sign Language', 'English', ' Punjabi', ' Yiddish', ' Romany', ' French', 'Pushto', ' Minangkabau', 'Khasi', ' German', ' Tibetan', ' Manipuri', 'Mandarin', 'Malay', 'Russian', ' Gujarati', ' Klingon', ' Uighur', 'Spanish', ' Bable', ' Quechua', ' Thai', ' Slovenian', ' Indian Sign Language', ' Central American Indian languages', ' Old English', ' Tajik', ' English', 'Sinhalese', 'Chinese', 'Ukrainian', ' Hindi', 'Bulgarian', ' Cheyenne', ' Mende', ' Maori', 'Akan', ' Arabic', ' Danish', ' Lingala', ' Kriolu', 'Panjabi', ' Hebrew', 'Norwegian', 'Serbo-Croatian', ' Armenian', ' Japanese Sign Language', 'Catalan', 'Hokkien', 'Tagalog', ' Polynesian', ' Spanish', ' Turkish', ' Italian', ' Xhosa', ' Serbian', 'Shona', ' Serbo-Croatian', 'Hebrew', 'Slovenian', 'Croatian', ' Flemish', ' Afrikaans', 'Min Nan', ' Chechen', ' Cree', ' Icelandic', ' Basque', ' Awadhi', ' Nama', 'Khmer', ' Hokkien', ' Kannada', 'Nepali', ' East-Greenlandic', 'Indonesian', ' Swedish', ' Catalan', ' Aragonese', ' Min Nan', ' Marathi', ' Cantonese', ' Aboriginal', 'Kannada', ' Urdu', ' Kazakh', 'French', 'Danish', ' Hawaiian', 'Portuguese', ' Russian', ' Finnish', ' Wolof', ' Persian', ' Mongolian', ' Nyanja', ' Norwegian', 'Cantonese', ' Romanian', ' Sindarin', ' Nepali', ' Mandarin', ' Southern Sotho', ' Tarahumara'}
145

   language_no            language
0            0    Berber languages
1            1              Pushto
2            2            Romanian
3            3           Hungarian
4            4  Egyptian (Ancient)

In [21]:
# Break out languages with show_id
language_all_df = merged_df.loc[:,['show_id', 'language']]
language_all_df = language_all_df.explode('language')
language_all_df['language'] = language_all_df['language'].str.strip()
language_all_df.dropna(inplace = True)
language_all_df.head()

    show_id language
0  81145628  English
1  80117401  English
1  80117401    Dutch
2  70234439  English
3  80058654  English

In [22]:
# merge tables to create show_id and language_no table
language_table = language_all_df.merge(language_df,how = "left", on="language")
language_table = language_table.loc[:,['show_id','language_no']]
print(len(language_table))
language_table.head()

7253

    show_id  language_no
0  81145628          109
1  80117401          109
2  80117401           48
3  70234439          109
4  80058654          109

In [23]:
title_df = merged_df.drop(columns=["listed_in","genre","language","Unnamed: 0"])
title_df_show = title_df.loc[title_df.show_id == 80057969]
title_df_show
print(len(title_df))
title_df.head()

6234

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,description,runtime,imdbRating,imdbVotes,poster,awards,boxoffice
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,Before planning an awesome wedding for his gra...,90 min,3.3,311,https://m.media-amazon.com/images/M/MV5BNjMwZD...,NaN,NaN
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Jandino Asporaat riffs on the challenges of ra...,95 min,4.8,23,https://m.media-amazon.com/images/M/MV5BMWE3MG...,NaN,NaN
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,"With the help of three human allies, the Autob...",30 min,7.9,5454,https://m.media-amazon.com/images/M/MV5BMTczND...,14 wins & 26 nominations.,NaN
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,When a prison ship crash unleashes hundreds of...,22 min,6.0,842,https://m.media-amazon.com/images/M/MV5BMjMwNT...,2 wins & 11 nominations.,NaN
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,When nerdy high schooler Dani finally attracts...,NaN,NaN,0,NaN,NaN,NaN

## Load data into postgres using sqlalchemy

In [24]:
# create connection to ETL_project_DB in postgres
engine = create_engine('postgresql://postgres:'+password+'@localhost:5432/Netflix_movies')
connection = engine.connect()

In [25]:
# check table names in database
engine.table_names()

['OMDB_genre',
 'OMDB_title_genre',
 'Title',
 'Netflix_Listed_in',
 'Netflix_title_Listed_in',
 'OMDB_language',
 'OMDB_title_language']

In [27]:
# load dataframes into postgres using pandas
title_df.to_sql(name='Title', con=engine, if_exists='append', index=False)

netflix_genre_id.to_sql(name='Netflix_Listed_in', con=engine, if_exists='append', index=False)
netflix_genre_table.to_sql(name='Netflix_title_Listed_in', con=engine, if_exists='append', index=False)

omdb_genre_id.to_sql(name='OMDB_genre', con=engine, if_exists='append', index=False)
omdb_genre_table.to_sql(name='OMDB_title_genre', con=engine, if_exists='append', index=False)

language_df.to_sql(name='OMDB_language', con=engine, if_exists='append', index=False)
language_table.to_sql(name='OMDB_title_language', con=engine, if_exists='append', index=False)